<template>
  <section>
    <div class="container">
      <h3 class="section-title-2">常見問題</h3>
      <p class="fs-24 fw-bold mb-24">我想詢問配鏡問題</p>
      <div class="row">
        <div class="col-8 col-md-12">
          <ul>
            <li class="questionItem" v-for="(item, i) in QList" :key="i">
              <h5 class="fw-bold fs-20 mb-8">{{ item.question }}</h5>
              <p>
                {{ item.answer }}
              </p>
            </li>
          </ul>
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>
import { reactive } from "vue";
let QList = reactive([
  {
    question: "Q1.請問可否自備鏡框單配鏡片？",
    answer:
      "A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。",
  },
  {
    question: "Q2.眼鏡都可以20分鐘取件嗎？",
    answer:
      "A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。",
  },
  {
    question: "Q3.散光鏡片需要額外加價嗎？",
    answer:
      "A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。",
  },
  {
    question: "Q4.我可以使用舊眼鏡的度數配鏡片嗎？",
    answer:
      "A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。",
  },
  {
    question: "Q5.請問可以單購買鏡框嗎？",
    answer:
      "A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。。",
  },
]);
</script>
